const Footer = () => {
    return (  
       <div style={{background: "#F5F5F5"  , color:"#7606B2", height:"14.43rem" , width:"100%" , paddingRight:"12.88rem" , paddingTop:"2.38rem"}}>
        <div className="flex flex-col  justify-between items-start">
            <div className=" flex flex-row  justify-between items-center">
                <div className=" flex flex-row  justify-between items-center">
                <div  className=" flex flex-col  justify-between items-start">
                    <div>
                        <p style={{fontWeight:"700"}} className="  text-xl ">تماس باما</p>
                    </div>
                    <div  className=" pr-2 flex flex-col  justify-between items-end">
                        <div className="flex flex-row  justify-between items-center">
                            <p style={{fontWeight:"500"}} className="text-base">تلفن</p>
                            <p style={{fontWeight:"400"}} className=" text-sm">۹۸۹۰۲۱۲۳۴۵۶۷۸+</p>
                        </div>
                        <div>
                            <p  style={{fontWeight:"400"}} className=" text-sm">۹۸۹۰۲۱۲۸۷۱۲۶۳+</p>
                        </div>
                        <div>
                            <p style={{fontWeight:"400"}} className=" text-sm">۹۸۹۰۷۸۹۱۲۳۲۵۱+</p>
                        </div>
                    </div>
                </div>
                <div>
                    <div></div>
                    <div>
                    <svg xmlns="http://www.w3.org/2000/svg" width="25" height="24" viewBox="0 0 25 24" fill="none">
  <path d="M8.33334 3C5.57234 3 3.33334 5.239 3.33334 8V16C3.33334 18.761 5.57234 21 8.33334 21H16.3333C19.0943 21 21.3333 18.761 21.3333 16V8C21.3333 5.239 19.0943 3 16.3333 3H8.33334ZM18.3333 5C18.8853 5 19.3333 5.448 19.3333 6C19.3333 6.552 18.8853 7 18.3333 7C17.7813 7 17.3333 6.552 17.3333 6C17.3333 5.448 17.7813 5 18.3333 5ZM12.3333 7C15.0943 7 17.3333 9.239 17.3333 12C17.3333 14.761 15.0943 17 12.3333 17C9.57234 17 7.33334 14.761 7.33334 12C7.33334 9.239 9.57234 7 12.3333 7ZM12.3333 9C11.5377 9 10.7746 9.31607 10.212 9.87868C9.64941 10.4413 9.33334 11.2044 9.33334 12C9.33334 12.7956 9.64941 13.5587 10.212 14.1213C10.7746 14.6839 11.5377 15 12.3333 15C13.129 15 13.8921 14.6839 14.4547 14.1213C15.0173 13.5587 15.3333 12.7956 15.3333 12C15.3333 11.2044 15.0173 10.4413 14.4547 9.87868C13.8921 9.31607 13.129 9 12.3333 9Z" fill="#1892AD"/>
  <path d="M8.33334 3C5.57234 3 3.33334 5.239 3.33334 8V16C3.33334 18.761 5.57234 21 8.33334 21H16.3333C19.0943 21 21.3333 18.761 21.3333 16V8C21.3333 5.239 19.0943 3 16.3333 3H8.33334ZM18.3333 5C18.8853 5 19.3333 5.448 19.3333 6C19.3333 6.552 18.8853 7 18.3333 7C17.7813 7 17.3333 6.552 17.3333 6C17.3333 5.448 17.7813 5 18.3333 5ZM12.3333 7C15.0943 7 17.3333 9.239 17.3333 12C17.3333 14.761 15.0943 17 12.3333 17C9.57234 17 7.33334 14.761 7.33334 12C7.33334 9.239 9.57234 7 12.3333 7ZM12.3333 9C11.5377 9 10.7746 9.31607 10.212 9.87868C9.64941 10.4413 9.33334 11.2044 9.33334 12C9.33334 12.7956 9.64941 13.5587 10.212 14.1213C10.7746 14.6839 11.5377 15 12.3333 15C13.129 15 13.8921 14.6839 14.4547 14.1213C15.0173 13.5587 15.3333 12.7956 15.3333 12C15.3333 11.2044 15.0173 10.4413 14.4547 9.87868C13.8921 9.31607 13.129 9 12.3333 9Z" fill="#7606B2"/>
</svg>
                    </div>
                </div>
                </div>
                <div></div>
                <div></div>
            </div>
        </div>
       </div>
    );
}
 
export default Footer;